{
  "exp1": {
    "title": "Software Developer - CO-OP",
    "company": "Enero Solutions",
    "date": "January 2025 – April 2025",
    "description": "• Enabled centralized databases management within the same UI by devoloping a WPF desktop application using OOP and the MVVM architecture to streamline multi-database interactions and enhance user workflow efficiency.\n• Implemented NUnit tests by deploying database environments in Docker-based VMs to validate added methods.\n• Improved SQL query performance by creating partitioned and indexed configurations, achieving a 20% reduction in execution time as measured through custom benchmarking tests and fully documented for future optimization."
  },
  "exp2": {
    "title": "Software Developer - Intern",
    "company": "ADDINN Group",
    "date": "May 2023 – July 2023",
    "description": "• Automated real-time data manipulation workflows using Node.js, node-cron, and Axios, enabling reliable collection, validation, and storage of environmental data retrieved from external APIs.\n• Designed a responsive frontend with React, HTML, and CSS, ensuring reusability and cross-platform compatibility to visualize farming data and support informed irrigation decisions."
  },
    "exp3": {
    "title": "Tutor",
    "company": "Tutorat Pro",
    "date": "May 2024 – Mars 2025",
    "description": "• Provided personalized math tutoring which helped me learning various teaching methods to suit individual learning styles and needs.\n• Developed effective communication strategies and learned how to interact with children in a way that made complex math concepts understandable, using clear explanations, visual aids, and engaging methods to cater to their individual learning styles. \n• Covered various math topics including simple and more complex themes arithmetic, algebra, geometry, and calculus, ensuring thorough understanding and proficiency.\n• Assisted with homework assignments, exam preparation, and supplementary learning materials.\n• Monitored progress and adjusted teaching methods as needed to optimize learning outcomes.\n• Received positive feedback from students and their parents for improvements in grades and overall understanding of mathematical concepts."
  }
}