{
  "proj1": {
    "title": "CookBot",
    "skills": "Python, Java, YOLOv12, Ultralitics, PyTorch, TFLite, Android Studio, SQLite, Pandas, Matplotlib, Jupyter Lab",
    "description": "• Developing a mobile app that uses a YOLOv12-based computer vision model to detect ingredients from user photos and suggest personalized recipes via a custom matching algorithm.\n• Trained and optimized the object detection model with a custom dataset achieving 70% accuracy, then converted and deployed it using TensorFlow Lite and ONNX to enable efficient, real-time mobile performance.\n• Integrated the model into the app workflow, including real-time image capture, preprocessing (resizing, normalization), prediction, and UI display, ensuring optimized runtime and high prediction accuracy.\n• Prepared and cleaned a recipe dataset (Food.com) using Python scripting with Pandas to handle missing data and normalization, and created visualizations with Matplotlib to validate data quality.\n• Exploring deployment of vision model via cloud-based endpoints (e.g., Firebase Functions or GCP AI Platform). \n• Documented all stages of development, from data preparation to deployment, to support future collaboration.",
    "image": "image/CookBot.jpg",
    "link": "https://github.com/orgs/PersonalProjects-YassineXHedi/repositories"
  },
  "proj2": {
    "title": "Image Datasets Creation Tool",
    "skills": "Python, Selenium, Tkinter, Multi-threading (concurent.future)",
    "description": "• Built a Python-based Tkinter app that uses Selenium scripts to automate image scraping from Google sources, allowing users to generate curated datasets through a fully automated and interactive UI.\n• Added multi-threading to accelerate scraping and used scripting logic to display, preview, and manage batch downloads, streamlining the entire data collection process.\n• Supported curated ML dataset creation by integrating batch preview and selection into the scraping workflow.",
    "image": "image/web_scrapping_project.jpg",
    "link": "https://github.com/PersonalProjects-YassineXHedi/ImageDatasetCreation"
  },
  "proj3": {
    "title": "Food Vision",
    "skills": "Python, TensorFlow/Keras, Numpy, Pandas, Matplotlib, TensorBoard",
    "description": "• Developed convolutional neural network (CNN) models with TensorFlow and Keras, focusing on food image classification using EfficientNetV2 architecture.\n• Applied transfer learning techniques (fine-tuning and feature extraction) with callbacks (early stopping, learning rate reduction) to optimize training performance and prevent overfitting.\n• Integrated a data augmentation layer into the CNN model pipeline to enhance generalization, applying transformations such as rotation, flipping, and zoom during training.\n• Evaluated model accuracy using validation sets and confusion matrices; visualized training progress (loss and accuracy) with TensorBoard and Matplotlib to monitor performance and guide model improvements.",
    "image": "image/food_vision.jpg",
    "link": "https://github.com/PersonalProjects-YassineXHedi/FoodVision"
  },
  "proj4": {
    "title": "Custom PC Order Service",
    "skills": "Java, Android Studio, Firebase, JUnit, Mockito",
    "description": "• Led the development of a mobile app in Android Studio (Java) for building and customizing PC configurations.\n• Integrated Firebase Database to manage real-time synchronization of user activity across distributed clients.\n• Implemented unit tests with JUnit and Mockito to validate backend logic and verify Firebase database operations.",
    "image": "image/Custom PC.jpg",
    "link": "https://github.com/uOttawa-2024-2025-seg2505-projet/groupe-35"
  },
  "proj5": {
    "title": "Smart Irrigation System",
    "skills": "Arduino IDE, C++, Soil Moisture Sensor",
    "description": "• Built an Arduino-based irrigation system using soil moisture sensors to automate watering based on real-time data.\n• Integrated sensor feedback with responsive automation logic to ensure accurate and timely irrigation.",
    "image": "image/smart_irrigation.jpg",
    "link": "https://drive.google.com/drive/folders/1B9eMEj0YUpasy1C2F2vEWMY5pLajiKXZ"
  },
  "proj6": {
    "title": "TuniTour - Service Website",
    "skills": "HTML, CSS, JavaScript, React, Figma",
    "description": "• Built a responsive tour booking website using React, structuring the UI with reusable components and managing user input and state transitions via custom hooks.\n• Designed user-centric prototypes in Figma, mapping out two distinct navigation flows aligned with specific personas.\n• Ensured intuitive user experience across platforms (desktop, tablet, mobile) by applying mobile-first design principles and adaptive layouts.\n",
    "image": "image/TuniTour_Resized_2_2304x1792.png",
    "link": "https://github.com/YassineSahli04/TourBookingWebsite"
  },
  "proj7": {
    "title": "AgroData – Environmental Monitoring Platform",
    "skills": "Python (FastAPI, SQLAlchemy, Pandas), PostgreSQL, React (TypeScript, Mapbox GL), Axios, Tailscale VPN",
    "description": "• Secured remote data access by configuring a PostgreSQL server with an encrypted Tailscale VPN tunnel and controlled port-forwarding, ensuring consistent database availability while safely bypassing firewall limitations.\n• Designed a centralized PostgreSQL data model with automated ETL pipelines that standardize station data from heterogeneous APIs, enabling continuous synchronization with vendor services and powering real-time geospatial visualization.\n• Established a type-safe FastAPI–React communication layer by designing structured API endpoints and optimizing Axios requests with unified JSON/GeoJSON serialization, enabling real-time, high-performance map visualization.",
    "image": "image/AGRODATA.png",
    "link": "https://github.com/YassineSahli04/EnvironmentalStationsData"
  }
}
